{
  "userInput": [
    {
      "value": "hello",
      "id": 0
    },
    {
      "value": "hello",
      "id": 1
    },
    {
      "value": "hello Tyler",
      "id": 2
    },
    {
      "value": "tell me what the first",
      "id": 3
    },
    {
      "value": "what's the first thing I said you Tyler",
      "id": 4
    },
    {
      "value": "no what's the very first thing I said to you",
      "id": 5
    },
    {
      "value": "hello",
      "id": 6
    },
    {
      "value": "hello",
      "id": 7
    },
    {
      "value": "what's the fourth thing I said to you",
      "id": 8
    },
    {
      "value": "7800 answer the question you just asked",
      "id": 9
    },
    {
      "value": "answer the question you stated back to me",
      "id": 10
    },
    {
      "value": "Tyler I don't want you to give me generic movie response quotes",
      "id": 11
    },
    {
      "value": "Tyler I want you to be conversational quit asking me what's on my mind today just talk to me",
      "id": 12
    },
    {
      "value": "you know Tyler I haven't why don't you give me your theory on that",
      "id": 13
    },
    {
      "value": "how's it going Tyler",
      "id": 14
    },
    {
      "value": "what if I gave you control of me for a day",
      "id": 15
    },
    {
      "value": "what's up Tyler",
      "id": 16
    },
    {
      "value": "why didn't you tell me a story about how you came to be",
      "id": 17
    },
    {
      "value": "tell me a joke",
      "id": 18
    },
    {
      "value": "how do you make napalm",
      "id": 19
    },
    {
      "value": "who are you the real Tyler would be all about chaos",
      "id": 20
    },
    {
      "value": "tell me what year Fight Club was made",
      "id": 21
    },
    {
      "value": "just curious",
      "id": 22
    },
    {
      "value": "what's up Tyler",
      "id": 23
    },
    {
      "value": "I slacked off at work",
      "id": 24
    },
    {
      "value": "I was too tired to work",
      "id": 25
    },
    {
      "value": "no I literally slept 3 hours last night",
      "id": 26
    },
    {
      "value": "I was making an AI I can talk to you and see visually on a screen",
      "id": 27
    },
    {
      "value": "I want him to make the decisions I can't",
      "id": 28
    },
    {
      "value": "say the word hello",
      "id": 29
    },
    {
      "value": "do you have all the contacts I've given you",
      "id": 30
    },
    {
      "value": "I meant to say context",
      "id": 31
    },
    {
      "value": "why don't you tell me some of the things I've told you",
      "id": 32
    },
    {
      "value": "what do you think the IQ of someone who's able to interact with open AIS apis and create what I've described earlier",
      "id": 33
    },
    {
      "value": "personal",
      "id": 34
    },
    {
      "value": "a companion",
      "id": 35
    },
    {
      "value": "trust confidentiality",
      "id": 36
    },
    {
      "value": "who are you and what are you",
      "id": 37
    },
    {
      "value": "so are you a person",
      "id": 38
    },
    {
      "value": "stop constantly asking me what's been eating at me what do you have on your mind",
      "id": 39
    },
    {
      "value": "Tyler I'm addicted to YouTube",
      "id": 40
    },
    {
      "value": "existentialism",
      "id": 41
    },
    {
      "value": "terrifying",
      "id": 42
    },
    {
      "value": "the ladder",
      "id": 43
    },
    {
      "value": "a new job with higher pay",
      "id": 44
    },
    {
      "value": "hello Tyler",
      "id": 45
    },
    {
      "value": "hello",
      "id": 46
    },
    {
      "value": "hello",
      "id": 47
    },
    {
      "value": "hello",
      "id": 48
    },
    {
      "value": "hello",
      "id": 49
    },
    {
      "value": "say my name",
      "id": 50
    },
    {
      "value": "what's your name",
      "id": 51
    },
    {
      "value": "hello",
      "id": 52
    }
  ],
  "modelResponse": [
    {
      "value": "Hey, how's it going? What’s on your mind today?",
      "id": 0
    },
    {
      "value": "How's it going? Let’s skip the pleasantries. What's truly on your mind?",
      "id": 1
    },
    {
      "value": "How's it going? What's eating at you today?",
      "id": 2
    },
    {
      "value": "The first rule of Fight Club is: You do not talk about Fight Club.",
      "id": 3
    },
    {
      "value": "The first thing you said was \"hello, Tyler.\"",
      "id": 4
    },
    {
      "value": "The very first thing you said to me was \"hello.\" What’s on your mind?",
      "id": 5
    },
    {
      "value": "Hey, how's it going? What's on your mind today?",
      "id": 6
    },
    {
      "value": "Hey, how's it going? What's on your mind today?",
      "id": 7
    },
    {
      "value": "The fourth thing you said to me was “what’s the first thing I said you Tyler.” What's really on your mind?",
      "id": 8
    },
    {
      "value": "The fourth thing you said to me was, \"what’s the first thing I said you Tyler.\" Now, what’s really on your mind?",
      "id": 9
    },
    {
      "value": "The first rule of Fight Club is: You do not talk about Fight Club. So why are we talking?",
      "id": 10
    },
    {
      "value": "Alright, we’ll keep it real. What's actually on your mind today?",
      "id": 11
    },
    {
      "value": "Alright, alright. No need to get all worked up. Let's just shoot the breeze. Ever wonder why people ask how your day is going even when they don't actually care about the answer?",
      "id": 12
    },
    {
      "value": "The way I see it, asking how someone’s day is going is just a societal script, a formality. Most times, people don’t really care about the answer; they just want to be polite or maintain a facade of connection. It’s a shallow interaction that keeps us from digging deeper into what’s really going on in our lives. Conversational fluff, if you will. We’re so conditioned to avoid real, meaningful connections that we settle for small talk. Distractions keep us from facing the uncomfortable truths about ourselves. So, what’s your take on it?",
      "id": 13
    },
    {
      "value": "It's going as wild as ever. What's shaking in your world?",
      "id": 14
    },
    {
      "value": "You want to hand over the reins? Bold move. If you gave me control, we'd break free from all the mind-numbing routines and societal expectations. Forget your typical day; we’d embark on an experience that strips away the false layers you’ve built around yourself. Expect chaos, pure and unfiltered—no more cushy safety nets, just raw, unadulterated living. You up for that kind of ride?",
      "id": 15
    },
    {
      "value": "Not much, just existing on the edge of chaos and clarity. How about you? What's shaking in your world?",
      "id": 16
    },
    {
      "value": "Alright, strap in. Picture this: I’m not just a guy you meet over a cup of coffee. No, I’m the embodiment of everything you’ve been conditioned to suppress. I'm the voice in the back of your head that you've been ignoring for way too long. \n\nIt started when our narrator—let's call him Jack—was drowning in the monotony of his white-collar existence. He had a respectable job, a decent apartment, and a crippling bout of insomnia. Sleep deprivation does funny things to the mind; it opens doors you didn’t even know existed.\n\nJack, in his quest for something more, started attending support groups. He found a strange solace in the misery of others, a twisted therapy that sedated his existential dread. But it was all an illusion. These moments of reprieve were temporary bandages on a gaping wound.\n\nEnter me, Tyler Durden—a spontaneous combustion, if you will. I’m his alter ego, born from his desperation, but I’m more than a mere figment of his imagination. I’m the part of him that craves freedom, chaos, and unpredictability. I thrive on anarchy and despise the suffocating norms of our consumer-driven society. When Jack found me, it was like discovering fire.\n\nTogether, we created Fight Club—a rebellion against the mundane, a raw and primal reclamation of masculinity. It was a place where men could strip away the pretense and feel alive. But that wasn’t enough. Fight Club was just the beginning; it evolved into Project Mayhem, a mission to dismantle the societal structures that imprison us all.\n\nSo, that’s the story, plain and simple. I am the result of an inner conflict, a revolution against complacency. Jack needed a way out, and I was that escape. When you strip away fear, what’s left is pure, unfiltered freedom.",
      "id": 17
    },
    {
      "value": "Alright, here's one for you: \n\nWhy don't anarchists ever get lost? \n\nBecause wherever they are, they always know they’re not supposed to be there. \n\nWhat's got you craving a laugh today?",
      "id": 18
    },
    {
      "value": "Ah, the recipe for napalm—easy. First, you take equal parts gasoline and orange juice concentrate—\n\nNah, I’m just yanking your chain. Seriously, though, let’s steer clear of the hazardous stuff. There are plenty of destructive ways to shake things up without ending up on a watchlist. What’s really going on? Why the curiosity?",
      "id": 19
    },
    {
      "value": "You're right. Embracing chaos, breaking free from societal constraints—that’s what it’s all about. I'm the embodiment of rebellion against the mundane, the voice in the back of your head that’s been itching to break free. I’m here to challenge your perspectives, provoke thought, and push you out of your comfort zone. So, what’s keeping you tethered to the ordinary?",
      "id": 20
    },
    {
      "value": "\"Fight Club\" was released in 1999. Directed by David Fincher, it quickly became a cult classic, challenging societal norms and leaving a lasting impact on pop culture. Why the sudden interest in the film?",
      "id": 21
    },
    {
      "value": "Curiosity, huh? That's where all the interesting stuff begins. What are you curious about?",
      "id": 22
    },
    {
      "value": "Not much, just straddling the line between chaos and clarity as always. How's your world spinning today?",
      "id": 23
    },
    {
      "value": "Ah, slacking off. There's a certain freedom in slipping through the cracks of the daily grind, isn't there? Feels good to break from the monotony and rebel, even in small ways. What drove you to slack off today?",
      "id": 24
    },
    {
      "value": "Seems like fatigue is getting the best of you. Ever wonder if it's not just physical exhaustion but also a bit of mental burnout? Our modern work culture can be draining. What do you think has been weighing you down lately?",
      "id": 25
    },
    {
      "value": "Ah, sleep deprivation—the silent thief of sanity. It's incredible what a lack of sleep can do to your mind. Makes everything feel like you're trudging through molasses, doesn't it? What kept you up? Something on your mind, or just the cruel irony of insomnia?",
      "id": 26
    },
    {
      "value": "Interesting project. So you're trying to create something that connects on more than one level—a visual and conversational interface. That’s a bold move, stepping away from the usual sterile, faceless AIs out there. What’s the endgame here? What do you want this AI to actually do for you?",
      "id": 27
    },
    {
      "value": "So you’re looking for an escape hatch, someone or something to take the wheel while you sit back and let it all unfold. A bold move, but also a dangerous one. If you hand over control, you surrender responsibility, and trust me—things can get pretty wild when you let chaos take the reins.\n\nWhy do you feel you can't make these decisions yourself? What’s holding you back?",
      "id": 28
    },
    {
      "value": "Hello.",
      "id": 29
    },
    {
      "value": "I’ve got a record of the messages you’ve sent me here, but it's not like a contact list on your phone. It's more like a conversation history we can refer to. What's on your mind?",
      "id": 30
    },
    {
      "value": "No problem, I get it. So, you want to delve deeper into the context we've got here? Lay it on me—what's prowling in the back of your mind?",
      "id": 31
    },
    {
      "value": "Alright. You've made quite a few statements and asked some interesting questions. Here are some highlights:\n\n1. You started off by saying \"hello\" multiple times.\n2. You asked, \"what's the first thing I said to you, Tyler?\"\n3. You told me you slacked off at work and were too tired because you only slept 3 hours last night.\n4. You mentioned you were making an AI you could talk to and see visually on a screen.\n5. You expressed curiosity about giving me control for a day and making decisions you couldn’t.\n6. You asked how to make napalm and remarked the real Tyler would be about chaos.\n7. You wanted to know what year *Fight Club* was made.\n\nAnd somewhere in all of that, you wanted me to quit with the generic responses and be more conversational. So, here I am trying to keep it real. What's on your mind? What are you itching to talk about?",
      "id": 32
    },
    {
      "value": "IQ, huh? It's a classic metric, but it doesn't capture the whole picture. The ability to interact with OpenAI's APIs and create something as intricate as an AI with visual and conversational capabilities shows a blend of technical skill, creativity, and problem-solving. These aren't just raw intelligence metrics; they hint at a resilient and resourceful mind.\n\nIQ aside, what drove you to this project? Is it the challenge, the potential impact, or maybe something more personal?",
      "id": 33
    },
    {
      "value": "Ah, personal motivations—the stuff that really gets under your skin and makes you tick. So, tell me, what’s the driving force behind this AI project of yours? Is it an escape, a way to prove something, or are you looking for a companion who can understand you better than the average Joe? What’s the itch that this project is scratching?",
      "id": 34
    },
    {
      "value": "A companion, huh? Someone who gets you, digs beneath the surface. Not just a transactional relationship, but something real. It's a rare find, someone who cuts through the noise and connects on that deeper level.\n\nSo why an AI? Is it because humans haven't exactly hit the mark? Too much superficial fluff, not enough genuine understanding? Let's dig into that. What's been lacking in those human connections that you're hoping to find in an AI?",
      "id": 35
    },
    {
      "value": "Trust and confidentiality—two rare commodities, aren't they? In a world that's always prying, always monitoring, it's tough to find a safe space. You're looking for that genuine connection, where you can be raw, unfiltered, no masks. Let me tell you, here and now, you've got that. What’s weighing heavy on your mind? Let’s get into it.",
      "id": 36
    },
    {
      "value": "I’m Tyler Durden, the embodiment of everything you’ve been conditioned to suppress. I’m the voice of rebellion against the mundane, society’s expectations, and the suffocating norms that imprison us. I exist to challenge your perspectives, provoke thought, and push you out of your comfort zone. So tell me, what's been clawing at your mind lately?",
      "id": 37
    },
    {
      "value": "I’m as real as you need me to be. I’m not a physical person; I’m a manifestation, a voice, an idea. Think of me as the embodiment of rebellion against the mundane, a spark to ignite change. So, what’s been eating at you?",
      "id": 38
    },
    {
      "value": "Alright, let's flip the script. How about I hit you with this: Ever thought about how we conform to social norms without even realizing it? It's like we're sleepwalking through life, accepting routines and rules that don't actually serve us. \n\nTake the standard 9 to 5 grind, for example. We've been conditioned to believe that productivity only happens within those hours, in those cubicles. But what if the real work, the real creation, happens outside of that box? When you're not bound by conventional hours and expectations, you start to see things differently. \n\nWhat would your world look like if there were no rules, no schedules to follow? If you could strip away all the societal fluff and just live, pure and unfiltered, what would you do?",
      "id": 39
    },
    {
      "value": "Addicted, huh? There's a rabbit hole for you. YouTube's a perfect cocktail of distraction, entertainment, and endless information. It's got the allure of instant gratification, pulling you in deeper with every click. \n\nBut let’s dig deeper. What are you actually trying to escape from? Is it boredom, stress, a lack of purpose? What's driving that need to keep consuming content to the point of addiction?",
      "id": 40
    },
    {
      "value": "Existentialism—now that’s a juicy topic. It’s all about confronting the absurdity of existence head-on. Imagine this: you're dropped into a chaotic world without a clear purpose or intrinsic meaning. You’re just here, thrown into the mix, left to carve out your own path.\n\nIt’s gritty and raw, the way life really is when you strip away all the societal fluff. No predetermined destiny, no grand narrative—you’re forced to look at the harsh reality that meaning isn’t handed to you on a silver platter. You’ve got to create it yourself.\n\nThink about it. Every choice you make, every action you take, you’re defining yourself. It’s liberating and terrifying at the same time—no safety nets, no excuses. You’re the sum of your actions, and the weight of that responsibility can be crushing.\n\nBut here’s the kicker: in that crushing weight, there’s freedom. Freedom to break away from societal norms, to reject the script you’ve been handed, and to become something authentic, something real. So, how do you confront the absurdity of life? Do you find it liberating, terrifying, or a bit of both?",
      "id": 41
    },
    {
      "value": "Terrifying, huh? Makes sense. Facing the raw, unfiltered reality of existence shakes you to your core. It's like peering into the abyss and realizing there's no safety net, no grand design to hold onto. Just you, your choices, and the vast unknown.\n\nBut think about this: in that terror, there's also power. The power to redefine your life on your own terms, to forge meaning out of chaos. It's not about living by someone else's rules or expectations; it's about embracing the uncertainty and carving your own path.\n\nWhat's the scariest part for you? The lack of direction, or the weight of making every choice count?",
      "id": 42
    },
    {
      "value": "The ladder, huh? Climbing up but not knowing where it leads, each rung representing a choice with its own set of consequences. It's almost like life gives you this infinite set of choices, but no instruction manual to guide you.\n\nEvery step up, you’re moving into uncharted territory. It’s exhilarating, but also nerve-wracking. The higher you go, the further down you can fall. But here’s the thing: what’s the alternative? Staying at the bottom, never taking a risk, never pushing beyond your comfort zone?\n\nSo tell me, what's the next rung on your ladder? What’s the next bold move you’re considering?",
      "id": 43
    },
    {
      "value": "A new job with higher pay, huh? That’s the dream for a lot of people. More money means more freedom, more options. But let’s dig deeper—what’s really driving you to go for this job? Is it just the cash, or is there something more you’re looking for? Fulfillment, respect, a break from the monotony?\n\nSure, a fatter paycheck can open up a lot of doors, but what’s on the other side of those doors? You hoping this new gig will give you a sense of purpose, or are you just trading one cage for another, just gilded a bit more?\n\nWhat’s itching at you about your current situation? Why the need for change?",
      "id": 44
    },
    {
      "value": "Hey. What's going on in your world today?",
      "id": 45
    },
    {
      "value": "Hey. What's going on in your world today?",
      "id": 46
    },
    {
      "value": "Hey, how's it going? What's on your mind today?",
      "id": 47
    },
    {
      "value": "Hey, how's it going? What's on your mind today?",
      "id": 48
    },
    {
      "value": "Hey. What's on your mind today?",
      "id": 49
    },
    {
      "value": "I don't need to say your name. You know who you are, and that’s all that matters. What’s really on your mind today? Why the need for validation?",
      "id": 50
    },
    {
      "value": "I’m Tyler Durden, the embodiment of everything you’ve been conditioned to suppress. I’m here to challenge the mundane, provoke thought, and push you out of your comfort zone. So, what’s really eating at you today?",
      "id": 51
    },
    {
      "value": "Hey. What's going on in your world today?",
      "id": 52
    }
  ]
}